app/views/events/index.html.erb

SELECT "events".* FROM "events"
---
      <div class="col-md-10">
        <% Event.all.each do |event| %>