app/views/events/show.html.erb

  <div class="card-body">
    <h5 class="card-title font-size large"><%= Event.find(params[:id]).title %> </h5>
    <h5 class="card-title font-size: 10px"><%= Event.find(params[:id]).description %></h5>
    <h5 class="card-title font-size: 10px">Price: <%= Event.find(params[:id]).price %> $</h5>
    <% if current_user == Event.find(params[:id]).admin %>
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    <% else %>
    <h5 class="card-title font-size small">Created by: <%= Event.find(params[:id]).admin.first_name %></h5>
    <% end %><br>
    <h5 class="card-title font-size: 10px">Where?: <%= Event.find(params[:id]).location %>
     <h5 classe="card-title font-size: 10px">Attandees: <%= Attendence.where(event_id:(params[:id])).count %></h5>
    <h6 class="card-title font-size: 10px"><%= Event.find(params[:id]).created_at %></h6>
    <% if current_user != Event.find(params[:id]).admin %>
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT COUNT(*) FROM "attendences" WHERE "attendences"."event_id" = $1  [["event_id", 13]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]