app/controllers/attendences_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def new
        @event = Event.find(params[:event_id])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "attendences" ("stripe_customer_id", "attendee_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["stripe_customer_id", "tok_1E3SsXDY9hPhoa0eueOX7O0S"], ["attendee_id", 9], ["event_id", 4], ["created_at", "2019-02-13 18:54:47.739232"], ["updated_at", "2019-02-13 18:54:47.739232"]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def create
        @event = Event.find(params[:event_id])
        @amount = @event.price * 100


        customer = Stripe::Customer.create(
          :email => params[:stripeEmail],
          :source  => params[:stripeToken]
        )

        charge = Stripe::Charge.create(
          :customer    => customer.id,
          :amount      => @amount,
          :description => 'Rails Stripe customer',
          :currency    => 'usd'
        )

        Attendence.create(attendee: current_user, event: Event.find(params[:event_id]), stripe_customer_id: params[:stripeToken])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
    def index
        @event = Event.find(params[:event_id])