app/controllers/events_controller.rb

INSERT INTO "events" ("start_date", "title", "description", "price", "location", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = current_user
    @event = Event.new(title: params["title"].capitalize, description: params["description"], price: params["price"],
    admin: @user, location: params["location"].capitalize, start_date: params["start_date"])

    if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "events" SET "start_date" = $1, "location" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["start_date", nil], ["location", "Marseille"], ["updated_at", "2019-02-14 01:02:11.640003"], ["id", 11]]
---
  def update
    @event = Event.find(params[:id])
    if @event.update(title: params["title"], start_date: params["start_date"], description: params["description"],
      duration: params["duration"], location: params["location"], price: params["price"], admin: current_user)