app/views/attendences/index.html.erb

SELECT COUNT(*) FROM "attendences" WHERE "attendences"."event_id" IS NULL
---
    <h5 class="card-title font-size: 10px">Where?: <%= @event.location %>
    <h5 classe="card-title font-size: 10px">Attandees: <%= Attendence.where(event_id:(params[:id])).count %></h5>